; domain
;; Woodworking
;;

(define (domain woodworking)
  (:requirements :typing :action-costs)
  (:types
      acolour awood woodobj machine 
      surface treatmentstatus
      aboardsize apartsize - object
      highspeed-saw glazer grinder immersion-varnisher
      planer saw spray-varnisher - machine
      board part - woodobj)

  (:constants
              verysmooth smooth rough - surface
              varnished glazed untreated colourfragments - treatmentstatus
              natural - acolour
              small medium large - apartsize)

  (:predicates 
            (unused ?obj - part)
            (available ?obj - woodobj)

            (surface-condition ?obj - woodobj ?surface - surface)
            (treatment ?obj - part ?treatment - treatmentstatus)
            (colour ?obj - part ?colour - acolour)
            (wood ?obj - woodobj ?wood - awood)
            (boardsize ?board - board ?size - aboardsize)
            (goalsize ?part - part ?size - apartsize)
            (boardsize-successor ?size1 ?size2 - aboardsize)

            (in-highspeed-saw ?b - board ?m - highspeed-saw)
            (empty ?m - highspeed-saw)
            (has-colour ?machine - machine ?colour - acolour)
            (contains-part ?b - board ?p - part)
            (grind-treatment-change ?old ?new - treatmentstatus)
            (is-smooth ?surface - surface))
      
  (:functions (total-cost) - number
            (spray-varnish-cost ?obj - part) - number
            (glaze-cost ?obj - part) - number
            (grind-cost ?obj - part) - number
            (plane-cost ?obj - part) - number)

  (:action do-immersion-varnish
    :parameters (?x - part ?m - immersion-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and
            (increase (total-cost) 10)
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-spray-varnish
    :parameters (?x - part ?m - spray-varnisher 
                 ?newcolour - acolour ?surface - surface)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (surface-condition ?x ?surface)
            (is-smooth ?surface)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (spray-varnish-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x varnished)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-glaze
    :parameters (?x - part ?m - glazer 
                 ?newcolour - acolour)
    :precondition (and
            (available ?x)
            (has-colour ?m ?newcolour)
            (treatment ?x untreated))
    :effect (and 
            (increase (total-cost) (glaze-cost ?x))
            (not (treatment ?x untreated))
            (treatment ?x glazed)
            (not (colour ?x natural))
            (colour ?x ?newcolour)))

  (:action do-grind
    :parameters (?x - part ?m - grinder ?oldsurface - surface
                 ?oldcolour - acolour 
                 ?oldtreatment ?newtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (is-smooth ?oldsurface)
            (colour ?x ?oldcolour)
            (treatment ?x ?oldtreatment)
            (grind-treatment-change ?oldtreatment ?newtreatment))
    :effect (and
            (increase (total-cost) (grind-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x verysmooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x ?newtreatment)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action do-plane
    :parameters (?x - part ?m - planer ?oldsurface - surface
                 ?oldcolour - acolour ?oldtreatment - treatmentstatus) 
    :precondition (and 
            (available ?x)
            (surface-condition ?x ?oldsurface)
            (treatment ?x ?oldtreatment)
            (colour ?x ?oldcolour))
    :effect (and
            (increase (total-cost) (plane-cost ?x))
            (not (surface-condition ?x ?oldsurface))
            (surface-condition ?x smooth)
            (not (treatment ?x ?oldtreatment))
            (treatment ?x untreated)
            (not (colour ?x ?oldcolour))
            (colour ?x natural)))

  (:action load-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (and
            (empty ?m)
            (available ?b))
    :effect (and
            (increase (total-cost) 30)
            (not (available ?b))
            (not (empty ?m))
            (in-highspeed-saw ?b ?m)))
            
  (:action unload-highspeed-saw
    :parameters (?b - board ?m - highspeed-saw)
    :precondition (in-highspeed-saw ?b ?m)
    :effect (and
            (increase (total-cost) 10)
            (available ?b)
            (not (in-highspeed-saw ?b ?m))
            (empty ?m)))
            
  (:action cut-board-small
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p small)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-medium
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p medium)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action cut-board-large
    :parameters (?b - board ?p - part ?m - highspeed-saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize)
    :precondition (and
            (unused ?p)
            (goalsize ?p large)
            (in-highspeed-saw ?b ?m)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 10)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural)
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-small
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface ?size_before ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p small)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-medium
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p medium)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))

  (:action do-saw-large
    :parameters (?b - board ?p - part ?m - saw ?w - awood
                 ?surface - surface 
                 ?size_before ?s1 ?s2 ?size_after - aboardsize) 
    :precondition (and 
            (unused ?p)
            (goalsize ?p large)
            (available ?b)
            (wood ?b ?w)
            (surface-condition ?b ?surface)
            (boardsize ?b ?size_before)
            (boardsize-successor ?size_after ?s1)
            (boardsize-successor ?s1 ?s2)
            (boardsize-successor ?s2 ?size_before))
    :effect (and
            (increase (total-cost) 30)
            (not (unused ?p))
            (available ?p)
            (wood ?p ?w)
            (surface-condition ?p ?surface)
            (colour ?p natural) 
            (treatment ?p untreated)
            (boardsize ?b ?size_after)))
)

; problem
; woodworking task with 12 parts and 125% wood
; Machines:
;   1 highspeed-saw
;   1 glazer
;   1 grinder
;   1 immersion-varnisher
;   1 planer
;   1 saw
;   1 spray-varnisher

(define (problem wood-prob)
  (:domain woodworking)
  (:objects
    highspeed-saw0 - highspeed-saw
    glazer0 - glazer
    grinder0 - grinder
    immersion-varnisher0 - immersion-varnisher
    planer0 - planer
    saw0 - saw
    spray-varnisher0 - spray-varnisher
    black white green red mauve blue - acolour
    cherry walnut pine - awood
    p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 - part
    b0 b1 b2 b3 - board
    s0 s1 s2 s3 s4 s5 s6 s7 s8 - aboardsize
  )
  (:init
    (grind-treatment-change varnished colourfragments)
    (grind-treatment-change glazed untreated)
    (grind-treatment-change untreated untreated)
    (grind-treatment-change colourfragments untreated)
    (is-smooth smooth)
    (is-smooth verysmooth)
    (= (total-cost) 0)
    (boardsize-successor s0 s1)
    (boardsize-successor s1 s2)
    (boardsize-successor s2 s3)
    (boardsize-successor s3 s4)
    (boardsize-successor s4 s5)
    (boardsize-successor s5 s6)
    (boardsize-successor s6 s7)
    (boardsize-successor s7 s8)
    (empty highspeed-saw0)
    (has-colour glazer0 blue)
    (has-colour glazer0 white)
    (has-colour glazer0 green)
    (has-colour glazer0 red)
    (has-colour glazer0 natural)
    (has-colour immersion-varnisher0 white)
    (has-colour immersion-varnisher0 blue)
    (has-colour spray-varnisher0 white)
    (has-colour spray-varnisher0 blue)
    (unused p0)
    (goalsize p0 medium)
    (= (spray-varnish-cost p0) 10)
    (= (glaze-cost p0) 15)
    (= (grind-cost p0) 30)
    (= (plane-cost p0) 20)
    (unused p1)
    (goalsize p1 small)
    (= (spray-varnish-cost p1) 5)
    (= (glaze-cost p1) 10)
    (= (grind-cost p1) 15)
    (= (plane-cost p1) 10)
    (unused p2)
    (goalsize p2 small)
    (= (spray-varnish-cost p2) 5)
    (= (glaze-cost p2) 10)
    (= (grind-cost p2) 15)
    (= (plane-cost p2) 10)
    (unused p3)
    (goalsize p3 medium)
    (= (spray-varnish-cost p3) 10)
    (= (glaze-cost p3) 15)
    (= (grind-cost p3) 30)
    (= (plane-cost p3) 20)
    (unused p4)
    (goalsize p4 small)
    (= (spray-varnish-cost p4) 5)
    (= (glaze-cost p4) 10)
    (= (grind-cost p4) 15)
    (= (plane-cost p4) 10)
    (available p5)
    (treatment p5 varnished)
    (surface-condition p5 verysmooth)
    (wood p5 cherry)
    (colour p5 white)
    (goalsize p5 small)
    (= (spray-varnish-cost p5) 5)
    (= (glaze-cost p5) 10)
    (= (grind-cost p5) 15)
    (= (plane-cost p5) 10)
    (available p6)
    (treatment p6 glazed)
    (surface-condition p6 smooth)
    (wood p6 walnut)
    (colour p6 black)
    (goalsize p6 medium)
    (= (spray-varnish-cost p6) 10)
    (= (glaze-cost p6) 15)
    (= (grind-cost p6) 30)
    (= (plane-cost p6) 20)
    (unused p7)
    (goalsize p7 large)
    (= (spray-varnish-cost p7) 15)
    (= (glaze-cost p7) 20)
    (= (grind-cost p7) 45)
    (= (plane-cost p7) 30)
    (unused p8)
    (goalsize p8 small)
    (= (spray-varnish-cost p8) 5)
    (= (glaze-cost p8) 10)
    (= (grind-cost p8) 15)
    (= (plane-cost p8) 10)
    (unused p9)
    (goalsize p9 small)
    (= (spray-varnish-cost p9) 5)
    (= (glaze-cost p9) 10)
    (= (grind-cost p9) 15)
    (= (plane-cost p9) 10)
    (unused p10)
    (goalsize p10 medium)
    (= (spray-varnish-cost p10) 10)
    (= (glaze-cost p10) 15)
    (= (grind-cost p10) 30)
    (= (plane-cost p10) 20)
    (available p11)
    (treatment p11 glazed)
    (surface-condition p11 rough)
    (wood p11 pine)
    (colour p11 blue)
    (goalsize p11 small)
    (= (spray-varnish-cost p11) 5)
    (= (glaze-cost p11) 10)
    (= (grind-cost p11) 15)
    (= (plane-cost p11) 10)
    (boardsize b0 s7)
    (wood b0 pine)
    (surface-condition b0 rough)
    (available b0)
    (boardsize b1 s2)
    (wood b1 pine)
    (surface-condition b1 rough)
    (available b1)
    (boardsize b2 s8)
    (wood b2 walnut)
    (surface-condition b2 rough)
    (available b2)
    (boardsize b3 s1)
    (wood b3 walnut)
    (surface-condition b3 rough)
    (available b3)
  )
  (:goal
    (and
    (available p0)
    (colour p0 blue)
    (wood p0 pine)
    (surface-condition p0 smooth)
    (treatment p0 glazed)
    (available p1)
    (wood p1 walnut)
    (treatment p1 glazed)
    (available p2)
    (surface-condition p2 verysmooth)
    (treatment p2 glazed)
    (available p3)
    (colour p3 green)
    (wood p3 walnut)
    (treatment p3 glazed)
    (surface-condition p3 verysmooth)
    (available p4)
    (wood p4 pine)
    (treatment p4 varnished)
    (available p5)
    (surface-condition p5 smooth)
    (treatment p5 glazed)
    (available p6)
    (colour p6 blue)
    (wood p6 walnut)
    (available p7)
    (colour p7 red)
    (surface-condition p7 verysmooth)
    (treatment p7 glazed)
    (available p8)
    (colour p8 white)
    (wood p8 pine)
    (treatment p8 varnished)
    (available p9)
    (colour p9 red)
    (treatment p9 glazed)
    (available p10)
    (colour p10 white)
    (treatment p10 glazed)
    (available p11)
    (colour p11 natural)
    (treatment p11 glazed)
    )
  )
  (:metric minimize (total-cost))
)

; plan
1. (do-saw-small b2 p1 saw0 walnut rough s8 s7)
   deleted: (unused p1)
   added: (available p1) (wood p1 walnut) (surface-condition p1 rough) (colour p1 natural) (treatment p1 untreated) (boardsize b2 s7)
   goals met: 7 of 42
2. (do-saw-small b0 p2 saw0 pine rough s7 s6)
   deleted: (unused p2)
   added: (available p2) (wood p2 pine) (surface-condition p2 rough) (colour p2 natural) (treatment p2 untreated) (boardsize b0 s6)
   goals met: 8 of 42
3. (do-saw-medium b0 p10 saw0 pine rough s6 s5 s4)
   deleted: (unused p10)
   added: (available p10) (wood p10 pine) (surface-condition p10 rough) (colour p10 natural) (treatment p10 untreated) (boardsize b0 s4)
   goals met: 9 of 42
4. (do-saw-medium b0 p0 saw0 pine rough s4 s3 s2)
   deleted: (unused p0)
   added: (available p0) (wood p0 pine) (surface-condition p0 rough) (colour p0 natural) (treatment p0 untreated) (boardsize b0 s2)
   goals met: 11 of 42
5. (do-plane p2 planer0 rough natural untreated)
   deleted: (surface-condition p2 rough)
   added: (surface-condition p2 smooth)
   goals met: 11 of 42
6. (do-plane p11 planer0 rough blue glazed)
   deleted: (surface-condition p11 rough) (treatment p11 glazed) (colour p11 blue)
   added: (surface-condition p11 smooth) (treatment p11 untreated) (colour p11 natural)
   goals met: 11 of 42
7. (do-plane p0 planer0 rough natural untreated)
   deleted: (surface-condition p0 rough)
   added: (surface-condition p0 smooth)
   goals met: 12 of 42
8. (do-grind p6 grinder0 smooth black glazed untreated)
   deleted: (surface-condition p6 smooth) (treatment p6 glazed) (colour p6 black)
   added: (surface-condition p6 verysmooth) (treatment p6 untreated) (colour p6 natural)
   goals met: 12 of 42
9. (do-grind p2 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p2 smooth)
   added: (surface-condition p2 verysmooth)
   goals met: 13 of 42
10. (do-glaze p2 glazer0 blue)
   deleted: (treatment p2 untreated) (colour p2 natural)
   added: (treatment p2 glazed) (colour p2 blue)
   goals met: 14 of 42
11. (do-glaze p11 glazer0 natural)
   deleted: (treatment p11 untreated)
   added: (treatment p11 glazed)
   goals met: 15 of 42
12. (do-glaze p10 glazer0 white)
   deleted: (treatment p10 untreated) (colour p10 natural)
   added: (treatment p10 glazed) (colour p10 white)
   goals met: 17 of 42
13. (do-glaze p1 glazer0 blue)
   deleted: (treatment p1 untreated) (colour p1 natural)
   added: (treatment p1 glazed) (colour p1 blue)
   goals met: 18 of 42
14. (do-glaze p0 glazer0 blue)
   deleted: (treatment p0 untreated) (colour p0 natural)
   added: (treatment p0 glazed) (colour p0 blue)
   goals met: 20 of 42
15. (do-glaze p6 glazer0 blue)
   deleted: (treatment p6 untreated) (colour p6 natural)
   added: (treatment p6 glazed) (colour p6 blue)
   goals met: 21 of 42
16. (do-plane p5 planer0 verysmooth white varnished)
   deleted: (surface-condition p5 verysmooth) (treatment p5 varnished) (colour p5 white)
   added: (surface-condition p5 smooth) (treatment p5 untreated) (colour p5 natural)
   goals met: 22 of 42
17. (do-glaze p5 glazer0 blue)
   deleted: (treatment p5 untreated) (colour p5 natural)
   added: (treatment p5 glazed) (colour p5 blue)
   goals met: 23 of 42
18. (do-saw-large b2 p7 saw0 walnut rough s7 s5 s6 s4)
   deleted: (unused p7)
   added: (available p7) (wood p7 walnut) (surface-condition p7 rough) (colour p7 natural) (treatment p7 untreated) (boardsize b2 s4)
   goals met: 24 of 42
19. (do-plane p7 planer0 rough natural untreated)
   deleted: (surface-condition p7 rough)
   added: (surface-condition p7 smooth)
   goals met: 24 of 42
20. (do-grind p7 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p7 smooth)
   added: (surface-condition p7 verysmooth)
   goals met: 25 of 42
21. (do-glaze p7 glazer0 red)
   deleted: (treatment p7 untreated) (colour p7 natural)
   added: (treatment p7 glazed) (colour p7 red)
   goals met: 27 of 42
22. (do-saw-medium b2 p3 saw0 walnut rough s4 s3 s2)
   deleted: (unused p3)
   added: (available p3) (wood p3 walnut) (surface-condition p3 rough) (colour p3 natural) (treatment p3 untreated) (boardsize b2 s2)
   goals met: 29 of 42
23. (do-plane p3 planer0 rough natural untreated)
   deleted: (surface-condition p3 rough)
   added: (surface-condition p3 smooth)
   goals met: 29 of 42
24. (do-grind p3 grinder0 smooth natural untreated untreated)
   deleted: (surface-condition p3 smooth)
   added: (surface-condition p3 verysmooth)
   goals met: 30 of 42
25. (do-glaze p3 glazer0 green)
   deleted: (treatment p3 untreated) (colour p3 natural)
   added: (treatment p3 glazed) (colour p3 green)
   goals met: 32 of 42
26. (do-saw-small b0 p4 saw0 pine rough s2 s1)
   deleted: (unused p4)
   added: (available p4) (wood p4 pine) (surface-condition p4 rough) (colour p4 natural) (treatment p4 untreated) (boardsize b0 s1)
   goals met: 34 of 42
27. (do-plane p4 planer0 rough natural untreated)
   deleted: (surface-condition p4 rough)
   added: (surface-condition p4 smooth)
   goals met: 34 of 42
28. (do-immersion-varnish p4 immersion-varnisher0 blue smooth)
   deleted: (treatment p4 untreated) (colour p4 natural)
   added: (treatment p4 varnished) (colour p4 blue)
   goals met: 35 of 42
29. (do-saw-small b0 p8 saw0 pine rough s1 s0)
   deleted: (unused p8)
   added: (available p8) (wood p8 pine) (surface-condition p8 rough) (colour p8 natural) (treatment p8 untreated) (boardsize b0 s0)
   goals met: 37 of 42
30. (do-plane p8 planer0 rough natural untreated)
   deleted: (surface-condition p8 rough)
   added: (surface-condition p8 smooth)
   goals met: 37 of 42
31. (do-immersion-varnish p8 immersion-varnisher0 white smooth)
   deleted: (treatment p8 untreated) (colour p8 natural)
   added: (treatment p8 varnished) (colour p8 white)
   goals met: 39 of 42
32. (do-saw-small b1 p9 saw0 pine rough s2 s1)
   deleted: (unused p9)
   added: (available p9) (wood p9 pine) (surface-condition p9 rough) (colour p9 natural) (treatment p9 untreated) (boardsize b1 s1)
   goals met: 40 of 42
33. (do-glaze p9 glazer0 red)
   deleted: (treatment p9 untreated) (colour p9 natural)
   added: (treatment p9 glazed) (colour p9 red)
   goals met: 42 of 42
